[
	{
		"company": "Uber ATG",
		"title": "Software Engineer Intern",
		"duration": "May 2020-August 2020",
		"img": {
			"path": "/uber_atg.png",
			"alt": "uber atg"
		},
		"desc": [
			"I will be working in Uber's Advanced Technologies Group (ATG) and helping them develop an autonomous vehicle!"
		],
		"links": [
			{
				"url": "https://www.uber.com/us/en/atg/",
				"text": "Website"
			}
		]
	},
	{
		"company": "Cornell Cup Robotics",
		"title": "CS Subteam Member",
		"duration": "August 2018-present",
		"img": {
			"path": "/cornellcup.png",
			"alt": "cornell cup"
		},
		"desc": [
			"Cornell Cup Robotics is a project team that constructs varied and unique robots. I frequently collaborated with other subteams from electrical and mechanical engineering to create a multipurpose robot called C1C0.",

			"I currently lead a group of undergraduates to build a chatbot feature for our robot that can answer queries like “what is the weather” using NLTK and various related APIs. Additionally, the robot can take vocal commands to move different parts of the robot, such as moving around or recognizing a person or object.",

			"A past feature I worked on also includes a facial recognition system that can perform attendance tracking. I designed the software stack to utilize a client-server model, which had a camera on the robot send pictures to an external computation server to process."
		],
		"links": [
			{
				"url": "http://cornellcuprobotics.com/",
				"text": "Website"
			}
		]
	},
	{
		"company": "Juni Learning",
		"title": "Computer Science Instructor",
		"duration": "January 2020-May 2020",
		"img": {
			"path": "/juni_learning.png",
			"alt": "juni logo"
		},
		"desc": [
			"Juni Learning is an online platform to tutor students in computer science and math. I’m currently an instructor teaching students ranging from ages 8-13 various topics in computer computer science. These include the basics of Python, data structures and algorithms, and basic data analysis.",

			"I, along with over 400 other instructors, help to continuously iterate and develop the curriculum for the thousands of students served on the platform."
		],
		"links": [
			{
				"url": "https://junilearning.com/",
				"text": "Website"
			}
		]
	},
	{
		"company": "Robotic Personal Assistants Lab",
		"title": "Undergraduate Researcher",
		"duration": "June 2019-August 2019",
		"img": {
			"path": "/rpal.svg",
			"alt": "rpal lab logo"
		},
		"desc": [
			"I worked as a part of a multidisciplinary team to command a robot to autonomously assemble furniture kits.",
			"I combined the usage of different sensors and devices (including an Xbox Kinect!) to solve construction related problems, such as the classic peg-in-hole problem.",
			"OpenCV was utilized to detect different objects to grasp, as well as areas to place those objects."
		],
		"links": [
			{
				"url": "https://rpal.cs.cornell.edu/",
				"text": "Website"
			}
		]
	},
	{
		"company": "And Chill",
		"title": "Software Engineer Intern",
		"duration": "June 2017-August 2017",
		"img": {
			"path": "/andchill.jpg",
			"alt": "andchill logo"
		},
		"desc": [
			"And Chill is a chatbot (a program that automatically responds to user messages) that provides movie recommendations to users. This bot aims to have a more \"human\" approach to creating recommendations in a way that doesn't seem like a black box.",
			"I rewrote many parts of the codebase to follow standard programming patterns so that it would be easily maintainable. This includes overhauling the database system to use MongoDB, which dramatically increased the system's capacity.",
			"I also designed and implemented a broadcasting system that reached over 3000 users, boosting user retention by 50%."
		],
		"links": [
			{
				"url": "http://www.andchill.io/",
				"text": "Website"
			}
		]
	},
	{
		"company": "Zero Robotics - StuyNaught",
		"title": "President and Lead Programmer",
		"duration": "September 2015-January 2018",
		"img": {
			"path": "/stuynaught.png",
			"alt": "stuynaught logo"
		},
		"desc": [
			"I was part of my high school's Zero Robotics team, StuyNaught.",
			"This competition involves programming robots in a language similar to C to maneuver in zero-gravity conditions to accomplish various tasks. These programs are eventually deployed on SPHERE robots aboard the International Space Station.",
			"Our team has reached the international finals very year of the team's existence (except for one) and placed 1st in the 2017-2018 season.",
			"In my senior year, I led a team of 20 students and collaborated with another international team of 10 students."
		],
		"links": [
			{
				"url": "http://zerorobotics.mit.edu/",
				"text": "Competition Website"
			},
			{
				"url": "http://stuynaught.github.io/",
				"text": "Team Website"
			}
		]
	}
]

